{"2232": {"cooktime": "serves 4 cook time 60 minutes", "directions": ["", "Heat 2 tablespoons of the oil in a large Dutch oven over high heat. Season the chicken pieces on both sides with salt and pepper and place in the pan, skin side down and cook until golden brown, 3 to 4 minutes. Turn the breasts over and cook until golden brown, 2 to 3 minutes. Remove the chicken to a large plate.", "Add the remaining oil to the pan and heat until almost smoking. Add the mushrooms and cook until golden brown, season with salt and pepper and remove to a plate.", "Add the onion and bell pepper to the pan and cook until soft, 3 to 4 minutes. Add the serrano, garlic and chili flakes to the pan and cook for 1 minute. Stir in the wine and cook until almost completely reduced. ", "Add the chicken stock, tomatoes, and rosemary and bring to a simmer. ", "Return the chicken and mushrooms to the pan, reduce the heat to medium-low, cover the pan and cook until the chicken is tender, about 30 minutes. ", "Remove the chicken with a slotted spoon to a large shallow bowl and tent loosely with foil.", "Increase the heat to high and cook the sauce, stirring occasionally, until slightly thickened, 8 to 10 minutes. Season with salt and pepper, stir in the vinegar and basil and pour the sauce over the chicken. Garnish with fresh basil sprigs. Serve over spaghetti and sprinkle with grated cheese.", "", ""], "image": "http://www.openeats.org//site-media/upload/recipe_photos/hunters-chicken.jpg", "ingredients": "\n 2 tablespoons\n                            - balasmic vinaigrette \n 1 tablespoons\n                            - black pepper \n 1 pound\n                            - button mushrooms \n 3 pound\n                            - chicken cut\n 1 cup \n                            - chicken broth \n 1 can\n                            - diced tomatos \n 3 cloves\n                            - garlic minced\n 3 tablespoons\n                            - olive oil \n 1 large\n                            - red onion thinly sliced\n 1/4 teaspoon\n                            - red pepper flakes \n 1/2 cup \n                            - red wine dry\n 3 sprigs\n                            - rosemary \n 1 tablespoon\n                            - salt \n 1 whole\n                            - serrano pepper diced\n 1 large\n                            - yellow bell pepper Julienned\n", "tags": ["italian"], "title": "Chicken Cacciatore "}, "8333": {"cooktime": "serves 2 cook time 45 minutes", "directions": ["", "Pre-heat the oven to 425 degrees.", "Remove the skin from the cornish gamehens.", "Coat them in olive oil. Pierce the flesh with a fork to allow the flavor soak all the way through.", "Poor the lemon juice in the bottom of the pan and inside of the game hens.", "Rub the game hens with salt, pepper, and the lemon pepper seasoning.", "Place some rosemary inside of the game hens and on the outside of the game hens.", "Place the game hens in the oven and cook for about 45 mins.", "", ""], "image": "http://www.openeats.org//static-files/images/parsley.jpg", "ingredients": "\n 1 teaspoon\n                            - black pepper \n 2 whole\n                            - cornish game hens \n 1 teaspoon\n                            - kosher salt \n 1/2 cup\n                            - lemon juice \n 1 tablespoon\n                            - lemon pepper seasoning \n 3 tablespoons\n                            - olive oil \n 3 tablespoons\n                            - rosemary \n", "tags": ["american"], "title": "Lemon Pepper Game Hens "}, "9604": {"cooktime": "serves 60 cook time 15 minutes", "directions": ["", "Sanitize the 5 gallon carboy, funnel and stopper", "pour half a gallon of the apple juice into the carboy", "Add 1 pound of corn sugar to the half empty gallon of apple juice and shake and add to the carboy", "Repeat step three with another gallon of apple juice", "Add the rest of the apple juice", "Wait one month and serve", "", ""], "image": "http://www.openeats.org//site-media/upload/recipe_photos/Apfelwein.JPG", "ingredients": "\n 5 gallons\n                            - apple juice \n 2 pound\n                            - corn sugar \n 1 packet\n                            - Cote Des Blanc yeast \n", "tags": ["german"], "title": "Apfelwein "}}