{"1695": {"cooktime": "serves 6 cook time 30 minutes", "directions": ["", "Preheat oven to 350 degrees F.", "Cook noodles according to package directions; drain and set aside. Meanwhile, heat a heavy non-stick pan over medium-high heat and coat it with cooking spray. Add turkey and brown, breaking it up with a wooden spoon; cook until no pink color remains. Drain all the grease from the pan and then add salt and pepper. Add tomato sauce and squeeze the pulp of the roasted garlic into the turkey mixture. Stir to blend and simmer for 5 minutes.", "Combine cottage cheese, sour cream, fontina, and scallions in a bowl. Spread 1/2 of the turkey mixture across the bottom of a 2-quart casserole dish. Top with 1/2 of the noodles, followed by 1/2 of the cheese mixture. Repeat layers 1 more time. Sprinkle the Cheddar over top. Bake for 20 minutes or until cheesy is melted and bubbling.", "", ""], "image": "http://www.openeats.org//static-files/images/parsley.jpg", "ingredients": "\n 1/4 teaspoon\n                            - black pepper \n 1 cup\n                            - fat free cottage cheese \n 1 cup\n                            - fat free sour cream \n 1 cup\n                            - fontina cheese shreaded\n 2 tablespoons\n                            - garlic minced in jar\n 1 pound\n                            - ground turkey \n 1 tablespoon\n                            - kosher salt \n 1 cup\n                            - low fat cheddar cheese shreaded\n 8 ounces\n                            - rice noodles \n 8 whole\n                            - scallions chopped\n 8 ounces\n                            - tomato sauce \n", "tags": ["american"], "title": "Sour Cream Noodle Bake "}, "9086": {"cooktime": "serves 24 cook time 30 minutes", "directions": [" ", "Melt the butter in a 2-quart saucepan over low heat. Set aside to cool slightly.", "Sift together the flour, salt and baking soda onto a paper plate. Pour the butter into your  mixer bowl. Add the sugar and brown sugar and beat  on medium speed for 2 minutes.", "Meanwhile, whisk together the whole egg, the egg yolk, milk and vanilla extract in a measuring cup. Reduce the mixer speed and slowly add the egg mixture. Mix until thoroughly combined, about 30 seconds.", "Using the paper plate as a slide, gradually integrate the dry ingredients, stopping a couple of times to scrape down the sides of the bowl. Once the flour is worked in, drop the speed to \"stir\" and add the chocolate chips, peanut butter chips, and walnuts. Chill the dough for 1 hour.", "Preheat the oven to 375 degrees F and place racks in the top third and bottom third of the oven.", "Scoop the dough into 1 1/2-ounce portions onto parchment-lined half sheet pans, 6 cookies per sheet. Bake 2 sheets at a time for 15 minutes, rotating the pans halfway through. Remove from the oven, slide the parchment with the cookies onto a cooling rack and wait at least 5 minutes before devourin", " ", ""], "image": "http://www.openeats.org//site-media/upload/recipe_photos/soft-and-chewy-cookies.jpg", "ingredients": "\n 1 teaspoon\n                            - baking soda \n 12 ounces\n                            - bread flour \n 8 ounces\n                            - brown sugar light\n 8 ounces\n                            - butter unsalted\n 1 large\n                            - egg \n 1 large\n                            - egg yolk \n 1 teaspoon\n                            - kosher salt \n 6 ounces\n                            - peanut butter chips \n 6 ounces\n                            - semi-sweet chocolate chips \n 2 teaspoons\n                            - vanilla extract \n 3 ounces\n                            - walnuts chopped\n 2 ounces\n                            - white sugar \n 1 ounce\n                            - whole milk \n", "tags": ["american"], "title": "Chewy Cookie "}, "9400": {"cooktime": "serves 8 cook time 45 minutes", "directions": ["", "Pre-heat oven to 350 degrees", "In a large skillet over medium high heat, crumble sausage and add the onion and celery cook stiring occasionally until sausage is brown", "In a 9 by 13 inch casserole dish pour the cubed stuffing and add the cooked sausage mixture on top", "Sprinkle with poultry seasoning and the dried sage", "Pour the broth and butter over the top of the cubed stuffing and mix to combine", "Bake for 45 minute", "", ""], "image": "http://www.openeats.org//static-files/images/parsley.jpg", "ingredients": "\n 1/2 cup\n                            - butter melted\n 3 stalks\n                            - celery diced\n 2 1/2 cups\n                            - chicken broth \n 14 ounce\n                            - cube stuffing not instant\n 1 teaspoon\n                            - poultry seasoning \n 2 teaspons\n                            - sage \n 1 package\n                            - sage sausage roll \n 1 whole\n                            - white onion diced\n", "tags": ["american"], "title": "Savory Sage Stuffing "}}