{"7333": {"cooktime": "serves 4 cook time 15 minutes", "directions": ["", "", "Clean the mushroom caps", "In a large bowl add the mushroom caps and mix the olive oil, lemon juice, and garlic then let sit.", "Pre-heat the oven to 400 degrees", "Grill the onions or cook them in a pan with a small amount of olive oil.", "Place the mushrooms on a baking pan and place in the oven for around 15 mins or until soft.", "Once the mushrooms are cooked place a slice of cheese on each mushroom cap and put back in the oven till the cheese is melted.", "Serve on a toasted kaiser roll with the onions and brown mustard.", "", "", ""], "image": "http://www.openeats.org//static-files/images/parsley.jpg", "ingredients": "\n 4 tablespoons\n                            - brown mustard \n 2 tablespoons\n                            - garlic cloves crushed\n 4 whole\n                            - kaiser rolls \n 4 tablespoons\n                            - lemon juice \n 1 tablespoon\n                            - olive oil \n 4 whole\n                            - portabella mushroom caps \n 4 slices\n                            - provolone cheese \n 1 whole\n                            - red onion sliced\n", "tags": ["american"], "title": "Portabello Burger "}, "9861": {"cooktime": "serves 4 cook time 15 minutes", "directions": ["", "In a bowl, mix the mayonnaise, pesto, minced garlic, and lemon juice. Set aside in the refrigerator.", "Preheat the grill ", "Brush vegetables with olive oil on each side. Brush grate with oil. Place bell peppers and zucchini closest to the middle of the grill, and set onion and squash pieces around them. Cook for about 3 minutes, turn, and cook for another 3 minutes. The peppers may take a bit longer. Remove from grill, and set aside.", "Spread some of the mayonnaise mixture on the cut sides of the bread, and sprinkle each one with goat cheese. Place on the grill, cheese side up, and cover with lid for 2 to 3 minutes. This will warm the bread, and slightly melt the cheese. Watch carefully so the bottoms don't burn. Remove from grill, and layer with the vegetables.", "", ""], "image": "http://www.openeats.org//static-files/images/parsley.jpg", "ingredients": "\n 1/4 cup\n                            - basil pesto \n 1 loaf\n                            - focaccia bread \n 3 gloves\n                            - garlic  minced from a jar\n 1/2 cup\n                            - goat cheese crumbled\n 1 tablespoon\n                            - lemon juice \n 1/4 cup\n                            - mayonnaise \n 3 tablespoons\n                            - olive oil \n 1 whole\n                            - red bell pepper sliced\n 1 whole\n                            - red onion sliced\n 1 whole\n                            - yellow squash sliced\n 1 whole\n                            - zucchini sliced\n", "tags": ["american"], "title": "Grilled Veggie Sandwich "}, "9951": {"cooktime": "serves 8 cook time 120 minutes", "directions": ["Put butter, brown sugar and sliced onions into a large pot over medium heat. Cook until onions are dark brown and almost mush, about 45 minutes to an hour, stirring from time to time.Slice your tators to about 1/8 to 1/4 inch thick. Put one layer of potato rounds in the bottom of a rectangular casserole dish. Put a thin layer of caramelized onions on top followed by a sprinkle of rosemary, a sprinkle of cheese, a drizzle of cream and a pinch of salt and pepper. Repeat the layers until you are out of potatoes or onions. I usually get about three layers but it would depend on the size of your casserole dish.Cook at 375 for 50 minutes to an hour. Test tator layers with a fork to make sure they are done. Remove from oven and let cool for 5 minutes.", ""], "image": "http://www.openeats.org//static-files/images/parsley.jpg", "ingredients": "\n 1 pinch\n                            - black pepper \n 1/2 cup\n                            - brown sugar light\n 1/2 stick\n                            - butter \n 1 cup\n                            - cream \n 1 pinch\n                            - kosher salt \n 1 cup\n                            - monterey jack cheese shredded\n 1/2 cup\n                            - rosemary chopped\n 4 large\n                            - sweet onions sliced thin\n 6 large\n                            - yukon gold potatos sliced thin\n", "tags": ["french"], "title": "Potato Onion Casserole "}}