{"3031": {"cooktime": "serves 6 cook time 75 minutes", "directions": ["", "Cook bacon over medium-low heat in a large stockpot or Dutch oven until almost crisp.", "Toss stew beef pieces with the flour, 1/2 teaspoon salt, and 1/8 teaspoon pepper.", "Add to the bacon mixture.", "Add olive oil mushrooms, celery, and onion.", "Cook over medium heat, stirring frequently, until beef is browned and onion is tender.", "Add beef broth and bay leaf. Cover and simmer over medium-low heat for 45 minutes.", "Add barley, carrots, and turnip. Reduce heat to low. Cover and simmer for 25 minutes.", "Add potatoes and simmer for about 25 minutes longer, or until vegetables and meat are tender", "If desired, stir in the flour and water mixture. Cook, stirring, until thickened and bubbly.", "", " ", ""], "image": "http://www.openeats.org//site-media/upload/recipe_photos/BeefBarleySoup.jpg", "ingredients": "\n 4 slices\n                            - bacon \n 1 whole\n                            - bay leaf \n 6 cups\n                            - beef broth \n 2 cups\n                            - carrots sliced\n 1 cup\n                            - celery sliced\n 3 tablespoons\n                            - flour \n 1 tablespoon\n                            - olive oil \n 1 1/2 cups\n                            - onion chopped\n 1/3 cup\n                            - pearled barley \n 1/8 teaspoon\n                            - pepper \n 1 large\n                            - potato cut in cubes\n 1/2 teaspoon\n                            - salt \n 8 ounces\n                            - sliced mushrooms \n 1 1/2 pounds\n                            - stew meat or beef round \n 2 cups\n                            - turnip diced\n", "tags": ["american"], "title": "Beef Barley Stew "}, "6298": {"cooktime": "serves 6 cook time 45 minutes", "directions": ["", "Preheat oven to 350°F. Lightly spray a loaf pan with baking spray. Place the strawberries on a baking sheet and roast for 25 minutes, remove and set aside", "In a medium bowl, combine flour, baking soda and salt with a wire whisk. Set aside.", "In a large bowl cream butter and sugar with an electric mixer. Add egg whites, bananas, apple sauce and vanilla, and beat at medium speed until thick. Scrape down sides of the bowl.", "Add flour mixture and blend at low speed until combined, do not over mix. Fold in strawberries and pour batter into the prepared loaf pans; bake in the center rack for about 50 minutes, or until a toothpick inserted in the center comes out clean.", "Let the pan cool at least 20 minutes, bread should be room temperature before slicing.", "", ""], "image": "http://www.openeats.org//site-media/upload/recipe_photos/100_4063-resize-640x649.jpg", "ingredients": "\n 3/4 teaspoon\n                            - baking soda \n 1 spray\n                            - baking spray \n 2 tablespoons\n                            - butter soften\n 2 large\n                            - eggs \n 1/2 cup\n                            - light brown sugar \n 3 whole\n                            - ripe bananas smashed\n 1/4 teaspoon\n                            - salt \n 1 1/4 cup\n                            - strawberries diced\n 2 tablespoons\n                            - unsweetened apple sauce \n 1 teaspoon\n                            - vanilla extract \n 1 1/4  cup\n                            - whole wheat flour \n", "tags": ["american"], "title": " Strawberry Banana Bread "}, "8444": {"cooktime": "serves 4 cook time 30 minutes", "directions": ["In a large bowl, whisk together vinegar, soy sauce, oil, rosemary, and Montreal steak seasoning. Place the mushroom caps in the bowl and toss with sauce, using a spoon to evenly coat. Let stand at room temperature for 20 to 30 minutes, turning a few times.", "Heat the grill or indoor grill pan over medium heat. When hot, brush the grate with oil or lightly spray the grill pan. Place the mushrooms on the grill, reserving marinade for basting. Grill for 5 to 7 minutes on each side, or until tender, brushing with marinade frequently. ", "Top the mushrooms with cheese during the last minute of cooking. While the mushrooms cook, grill the onions about 1 minute on each side and grill the buns until toasted.To finish, place the spinach and grilled portobello mushrooms on the buns and top with the grilled onions, sliced tomato and avocado.", ""], "image": "http://www.openeats.org//site-media/upload/recipe_photos/Portobello-Burger-1024x682.jpg", "ingredients": "\n 4 whole\n                            -  portobello mushroom caps \n 1 whole\n                            - avacado sliced\n 2 tbsp\n                            - balsamic vinegar \n 1 package\n                            - kaiser rolls \n 1 tbsp\n                            - olive oil \n 1 whole\n                            - red onion sliced\n 1 sprig\n                            - rosemary \n 1 tbsp\n                            - soy sauce \n 1 1/2 tsp\n                            - steak seasoning \n 4 slices\n                            - swiss cheese \n 1 whole\n                            - tomato sliced\n", "tags": ["american"], "title": "Super Portabello Burger "}}