{"4578": {"cooktime": "serves 6 cook time 35 minutes", "directions": [" ", "", "Preheat the oven to 375", "Brown the ground beef with the onion season with salt and pepper", "Once Brown drain the grease from the meat", "Pour about 2 ounces of the enchilada sauce into the meat and mix. Set aside", "Warm up the tortillas in the microwave or oven just enough to make them easier to handle.", "Slice both block cheeses and drain and rinse the beans in the can.", "Lay the tortillas out flat and scoop in some of the meat mixture and the beans. Add one of each kinds of cheese slices and fold the tortilla. Continue this step till all the meat mixture is gone. Place the tortillas in a baking dish and cover with the remaining enchilada sauce.", "Bake the enchiladas for around 20 to 25 minutes or until the tortillas look done.", "", ""], "image": "http://www.openeats.org//site-media/upload/recipe_photos/beef_enchiladas.jpg", "ingredients": "\n 1 can\n                            - black beans \n 1 block\n                            - cheddar cheese \n 12 ounces\n                            - enchilada sauce \n 1 pound\n                            - ground beef \n 1 block\n                            - monterey jack cheese \n 6 tablespoons\n                            - sour cream \n 1 package\n                            - Tortillas large\n 1 whole\n                            - white onion chopped\n", "tags": ["mexican"], "title": "Beef Enchiladas "}, "5426": {"cooktime": "serves 2 cook time 25 minutes", "directions": ["Pre Step", "", " Place the chicken in a zip lock bag and add the lime juice and fajita seasoning then shake to mix and set aside for an hour or so in the fridge.", "", " ", "", "Pre heat oven to 400 degrees", "Using a grill pan cook the chicken strips till done then when they cool enough chop them into bite size pieces", "In a baking dish add a layer of chips, then some of the chicken and sprinkle with cheese.", "Add another layer of chips and some of the chicken and sprinkle with cheese then add the onion, jalapenos, and tomatoes.", "Place the chips in the oven and bake till the cheese is full melted.", "Add the sour cream and salsa on the chips and serve.", "", " ", ""], "image": "http://www.openeats.org//static-files/images/parsley.jpg", "ingredients": "\n 3/4 pound\n                            - chicken tendorloin \n 1 packet\n                            - Fajita seasoning \n 2 tablespoons\n                            - jalapeno peppers pickled\n 1/2 cup\n                            - lime juice \n 1 cup\n                            - mexican cheese shreaded\n 1 whole\n                            - red onion diced\n 2 whole\n                            - roma tomatos \n 1/2 cup \n                            - salsa \n 2 tablespoons\n                            - sour cream \n 1 bag\n                            - tortila Chips \n", "tags": ["mexican"], "title": "Pub Chicken Nachos "}, "7423": {"cooktime": "serves 8 cook time 240 minutes", "directions": [" ", "", "Set the rib roast out to reach room tempature.", "Preheat the oven to 210 degrees", "Cover the bottom of a roasting pan with kosher salt", "Season the meat with the ground black pepper and seasoning salt", "Place the rib roast bone side down and cover in kosher salt. Don't wet the rib roast to get the salt to stick, this will cause the salt to melt and penetrate the meat.", "Place the roast in the stove and cook for around 4 to 5 hours or till the meat reaches around 122 degrees (for rare)", "Take out of the stove and tent in foil for 30 minutes or till the meat reaches 130 degrees (rare)", "To cook further then rare adjust the temperature of the meat accordingly. The meat will raise an average of 10 degrees during the thirty minute rest period.", "", ""], "image": "http://www.openeats.org//static-files/images/parsley.jpg", "ingredients": "\n 1 tablespoon\n                            - black pepper \n 3 cups\n                            - kosher salt \n 5 pound\n                            - rib roast three bone\n 1 tablespoon\n                            - season salt \n", "tags": ["american"], "title": "Salt Encrusted Standing Rib Roast "}}